# TRABALHO PRÁTICO 2

In [1]:
#NÃO ALTERE AS LINHAS ABAIXO
import sys
#!{sys.executable} -m pip install sqlite3
!{sys.executable} -m pip install pandas
#!{sys.executable} -m pip install csv
!{sys.executable} -m pip install gdown

Requirement already satisfied: pandas in /Users/lucascassio/anaconda3/lib/python3.11/site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/lucascassio/anaconda3/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/lucascassio/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /Users/lucascassio/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in /Users/lucascassio/anaconda3/lib/python3.11/site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in /Users/lucascassio/anaconda3/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Requirement already satisfied: gdown in /Users/lucascassio/anaconda3/lib/python3.11/site-packages (4.7.1)
Requirement already satisfied: filelock in /Users/lucascassio/anaconda3/lib/python3.11/site-packages (from gdown) (3.9.0)
Requirement already satisfied: requests[socks] in /Users/lucascassio/anaconda3/lib/python3.11/site-packages (from gdown) (2.31.0)
Requirement already satisfied: six in /Users/lucascassio/anaconda3/lib/python3.11/site-packages (from gdown) (1.16.0)
Requirement already satisfied: tqdm in /Users/lucascassio/anaconda3/lib/python3.11/site-packages (from gdown) (4.65.0)
Requirement already satisfied: beautifulsoup4 in /Users/lucascassio/anaconda3/lib/python3.11/site-packages (from gdown) (4.12.2)
Requirement already satisfied: soupsieve>1.2 in /Users/lucascassio/anaconda3/lib/python3.11/site-packages (from beautifulsoup4->gdown) (2.4)
Requirement already satisfied: charset-normalizer<4,>=2 in /Users/lucascassio/anaconda3/lib/python3.11/site-packages (from requests[socks]->gdown) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in /Users/lucascassio/anaconda3/lib/python3.11/site-packages (from requests[socks]->gdown) (3.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in /Users/lucascassio/anaconda3/lib/python3.11/site-packages (from requests[socks]->gdown) (1.26.16)
Requirement already satisfied: certifi>=2017.4.17 in /Users/lucascassio/anaconda3/lib/python3.11/site-packages (from requests[socks]->gdown) (2023.11.17)
Requirement already satisfied: PySocks!=1.5.7,>=1.5.6 in /Users/lucascassio/anaconda3/lib/python3.11/site-packages (from requests[socks]->gdown) (1.7.1)

In [2]:
#NÃO ALTERE AS LINHAS ABAIXO
import sqlite3 as sql3
import pandas as pd
import csv
import gdown

## Banco de Dados

In [3]:
url = "https://drive.google.com/uc?id=1yf-isUOwy4hA5SDNQOwTZY7IbwPZP0B8"
output = "databaseTP2sqlite.sql"
gdown.download(url, output, quiet=False)

Downloading...
From: https://drive.google.com/uc?id=1yf-isUOwy4hA5SDNQOwTZY7IbwPZP0B8
To: /Users/lucascassio/Downloads/TP2-IBD-main/databaseTP2sqlite.sql
100%|██████████████████████████████████████| 1.06M/1.06M [00:00<00:00, 2.32MB/s]

'databaseTP2sqlite.sql'

In [4]:
# Conecta-se ao banco de dados
con = sql3.connect(":memory:")
cur = con.cursor()

# Executa o script SQL
with open(output, encoding="utf8") as sql_file:
    db = sql_file.read()
    cur.executescript(db)

# Commit da transação
con.commit()

## Estrutura das Tabelas do Banco de Dados

### TABELA REGIOES

In [5]:
#NÃO ALTERE AS LINHAS ABAIXO
query = "PRAGMA table_info('regioes')"
df = pd.read_sql(query, con)
display(df)

   cid         name     type  notnull dflt_value  pk
0    0    regiao_id  INTEGER        0       None   1
1    1  nome_regiao     TEXT        0       None   0

### TABELA ABRANGENCIA SAUDE

In [6]:
#NÃO ALTERE AS LINHAS ABAIXO
query = "PRAGMA table_info('abrangencia_saude')"
df = pd.read_sql(query, con)
display(df)

   cid                       name     type  notnull dflt_value  pk
0    0  id_area_abrangencia_saude      INT        0       None   0
1    1                   cod_smsa      INT        0       None   0
2    2      nome_area_abrangencia     TEXT        0       None   0
3    3                nome_regiao     TEXT        0       None   0
4    4          nome_centro_saude     TEXT        0       None   0
5    5        nome_bairro_popular     TEXT        0       None   0
6    6          bairro_popular_id  INTEGER        0       None   0
7    7                  regiao_id  INTEGER        0       None   0

### TABELA REDE EQUIPAMENTOS ESPORTIVOS

In [7]:
#NÃO ALTERE AS LINHAS ABAIXO
query = "PRAGMA table_info('equipamentos_esportivos')"
df = pd.read_sql(query, con)
display(df)

   cid                 name     type  notnull dflt_value  pk
0    0            id_eq_esp      INT        0       None   0
1    1                 nome     TEXT        0       None   0
2    2         nome_popular     TEXT        0       None   0
3    3                 tipo     TEXT        0       None   0
4    4  nome_bairro_popular     TEXT        0       None   0
5    5          complemento     TEXT        0       None   0
6    6    bairro_popular_id  INTEGER        0       None   0

### TABELA REDE MUNICIPAL ESCOLAS

In [8]:
#NÃO ALTERE AS LINHAS ABAIXO
query = "PRAGMA table_info('rede_municipal_escolas')"
df = pd.read_sql(query, con)
display(df)

   cid                 name     type  notnull dflt_value  pk
0    0    id_equip_educacao      INT        0       None   0
1    1                 nome     TEXT        0       None   0
2    2  nome_bairro_popular     TEXT        0       None   0
3    3          nome_regiao     TEXT        0       None   0
4    4    bairro_popular_id  INTEGER        0       None   0
5    5            regiao_id  INTEGER        0       None   0

### TABELA BAIRROS

In [9]:
#NÃO ALTERE AS LINHAS ABAIXO
query = "PRAGMA table_info('bairros')"
df = pd.read_sql(query, con)
display(df)

   cid                 name     type  notnull dflt_value  pk
0    0    bairro_popular_id  INTEGER        0       None   1
1    1  nome_bairro_popular     TEXT        0       None   0

### TABELA FAMILIAS CRAS

In [10]:
#NÃO ALTERE AS LINHAS ABAIXO
query = "PRAGMA table_info('familias_cras')"
df = pd.read_sql(query, con)
display(df)

   cid                name     type  notnull dflt_value  pk
0    0         nome_regiao     TEXT        0       None   0
1    1       qtde_familias      INT        0       None   0
2    2  mes_ano_referencia     TEXT        0       None   0
3    3           regiao_id  INTEGER        0       None   0

## Arquivo de Resultados

In [11]:
#NÃO ALTERE AS LINHAS ABAIXO
tp1_csv = "TP2.csv"
queries = open(tp1_csv, 'w')
writer = csv.writer(queries, delimiter=';')
writer.writerow(["Query Number", "Row Count", "Query"])

30

## Função de Consulta
A função abaixo executa a consulta, exibe o retorno da consulta no banco e grava os dados necessários no arquivo resultado.

In [12]:
#NÃO ALTERE AS LINHAS ABAIXO
def runQuery(query, query_name):
  df = pd.read_sql(query, con)
  query_size = df.shape[0]
  writer.writerow([query_name, query_size, query])
  display(df)

## CONSULTAS SQL

### QUANTIDADE DE FAMILIAS INSCRITAS NO CRAS POR REGIÃO DE BH

In [13]:
a1 = "SELECT regioes.nome_regiao, SUM(familias_cras.qtde_familias) AS familias_regiao FROM regioes JOIN familias_cras ON regioes.regiao_id = familias_cras.regiao_id GROUP BY regioes.nome_regiao ORDER BY familias_regiao DESC;"
#NÃO ALTERE A LINHA ABAIXO
runQuery(a1, "a1")

            nome_regiao  familias_regiao
0                 NORTE            42245
1              BARREIRO            39171
2            VENDA NOVA            35514
3              NORDESTE            34773
4                 OESTE            29193
5                 LESTE            28713
6              NOROESTE            28236
7            CENTRO-SUL            24355
8              PAMPULHA            23328
9  Endereco FORA Region                6

### QUANTIDADE DE CENTROS DE SAÚDE POR REGIÃO DE BH

In [14]:
a2 = "SELECT regioes.nome_regiao, COUNT(abrangencia_saude.id_area_abrangencia_saude) AS centros_regiao FROM regioes JOIN abrangencia_saude ON regioes.nome_regiao = abrangencia_saude.nome_regiao GROUP BY regioes.nome_regiao ORDER BY centros_regiao DESC;"
#NÃO ALTERE A LINHA ABAIXO
runQuery(a2, "a2")

  nome_regiao  centros_regiao
0    NORDESTE              21
1       NORTE              20
2    BARREIRO              20
3       OESTE              18
4  VENDA NOVA              17
5    NOROESTE              16
6    PAMPULHA              14
7       LESTE              14
8  CENTRO-SUL              12

### QUANTIDADE DE ESCOLAS POR REGIÃO DE BH

In [15]:
a3 = "SELECT regioes.nome_regiao, COUNT(rede_municipal_escolas.id_equip_educacao) AS escolas_regiao FROM regioes JOIN rede_municipal_escolas ON regioes.nome_regiao = rede_municipal_escolas.nome_regiao GROUP BY regioes.nome_regiao ORDER BY escolas_regiao DESC;"
#NÃO ALTERE A LINHA ABAIXO
runQuery(a3, "a3")

  nome_regiao  escolas_regiao
0    BARREIRO              77
1    NORDESTE              75
2       NORTE              67
3  VENDA NOVA              64
4    NOROESTE              60
5       OESTE              56
6       LESTE              56
7    PAMPULHA              52
8  CENTRO-SUL              50

### QUANTIDADE DE CENTROS ESPORTIVOS POR BAIRRO DE BH

In [16]:
a4 = "SELECT equipamentos_esportivos.nome_bairro_popular, COUNT(equipamentos_esportivos.id_eq_esp) AS total_equipamentos FROM equipamentos_esportivos WHERE equipamentos_esportivos.nome_bairro_popular != 'None' GROUP BY equipamentos_esportivos.nome_bairro_popular ORDER BY total_equipamentos DESC LIMIT 10;"
#NÃO ALTERE A LINHA ABAIXO
runQuery(a4, "a4")

  nome_bairro_popular  total_equipamentos
0         MANGABEIRAS                  21
1      ALÍPIO DE MELO                  12
2          RIO BRANCO                  11
3         MINASLÂNDIA                  11
4              ITAPOÃ                  10
5              EYMARD                  10
6          CALIFÓRNIA                  10
7      VALE DO JATOBÁ                   9
8     SERRA DO CURRAL                   9
9           DOM BOSCO                   8

### TOP 10 BAIRROS COM MAIS CENTROS DE SAÚDE DE BH

In [17]:
a5 = "SELECT  regioes.nome_regiao, abrangencia_saude.nome_bairro_popular, COUNT(abrangencia_saude.id_area_abrangencia_saude) AS total_bairro FROM abrangencia_saude JOIN regioes ON abrangencia_saude.nome_regiao = regioes.nome_regiao GROUP BY abrangencia_saude.nome_bairro_popular ORDER BY total_bairro DESC LIMIT 10;"
#NÃO ALTERE A LINHA ABAIXO
runQuery(a5, "a5")

  nome_regiao      nome_bairro_popular  total_bairro
0       NORTE                Jaqueline             3
1  CENTRO-SUL            Santo Antônio             2
2  VENDA NOVA             Santa Mônica             2
3    NORDESTE         Ribeiro de Abreu             2
4    PAMPULHA               Ouro Preto             2
5  VENDA NOVA              Mantiqueira             2
6       OESTE          Madre Gertrudes             2
7    BARREIRO                  Lindéia             2
8  VENDA NOVA  Jardim dos Comerciarios             2
9       NORTE        Jardim Felicidade             2

### TOP 10 BAIRROS COM MAIS ESCOLAS DE BH

In [18]:
a6 = "SELECT regioes.nome_regiao, rede_municipal_escolas.nome_bairro_popular, COUNT(rede_municipal_escolas.nome_bairro_popular) AS total_bairro FROM rede_municipal_escolas JOIN regioes ON regioes.nome_regiao = rede_municipal_escolas.nome_regiao GROUP BY nome_bairro_popular ORDER BY total_bairro DESC LIMIT 10;"
#NÃO ALTERE A LINHA ABAIXO
runQuery(a6, "a6")

  nome_regiao nome_bairro_popular  total_bairro
0  VENDA NOVA            Céu Azul             8
1    BARREIRO               Tirol             7
2  VENDA NOVA         Mantiqueira             7
3    BARREIRO             Lindéia             7
4       NORTE   Jardim Felicidade             7
5       LESTE            Taquaril             6
6  CENTRO-SUL       Santo Antônio             6
7    PAMPULHA     Santa Terezinha             6
8       OESTE       Salgado Filho             6
9    NORDESTE      Jardim Vitória             6

# Finalizando o Banco de Dados e o Arquivo de Consultas gerado:

In [19]:
#NÃO ALTERE AS LINHAS ABAIXO
queries.close()
con.close()

## Compactando Arquivos
Na célula abaixo, substitua onde está escrito MATRÍCULA pelo seu número de matrícula.

In [20]:
!zip -r "TP2.zip" "TP2.ipynb" "TP2.csv"

  adding: TP2.ipynb (deflated 88%)
  adding: TP2.csv (deflated 75%)

**LEMBRE-SE:** Após finalizar todas as consultas, clique em *Kernel -> Restart and Run All* no ambiente em que estiver usando (Jupyter ou Google Colab)

Caso esteja usando o Google Colab, colocar manualmente o arquivo .ipynb no zip